for (let index = 0; index < temp.childNodes.length; index++) {
    const element = temp.childNodes[index];
    console.log(element.dataset.member, element.innerText)

}

// "03",# 上村 莉菜
// "04",# 尾関 梨香
// "06",# 小池 美波
// "07",# 小林 由依
// "08",# 齋藤 冬優花
// "11",# 菅井 友香
// "14",# 土生 瑞穂
// "15",# 原田 葵
// "18",# 守屋 茜
// "20",# 渡辺 梨加
// "21",# 渡邉 理佐
// "43",# 井上 梨名
// "44",# 関 有美子
// "45",# 武元 唯衣
// "46",# 田村 保乃
// "47",# 藤吉 夏鈴
// "48",# 松田 里奈
// "49",# 松平 璃子
// "50",# 森田 ひかる
// "51",# 山﨑 天
// "53",# 遠藤 光莉
// "54",# 大園 玲
// "55",# 大沼 晶保
// "56",# 幸阪 茉里乃
// "57",# 増本 綺良
// "58",# 守屋 麗奈
